return
given
integ
array
number
1
n
two
one
0
string
order
follow
exampl
-
repres
num
valu
length
x
element
posit
may
answer
minimum
note
2
maximum
ith
equal
0-index
k
find
time
sum
contain
possibl
charact
index
binari
must
first
consist
everi
true
start
differ
also
otherwis
initi
left
list
use
3
exist
right
node
result
-1
fals
row
make
letter
exactli
ie
least
tree
word
need
size
int
empti
count
oper
valid
j
move
sequenc
2d
choos
multipl
column
sort
want
type
7
b
form
digit
either
end
write
uniqu
queri
matrix
chang
take
remov
consid
root
total
key
defin
distinct
zero
anoth
adjac
indic
implement
format
rang
three
call
pair
non-empti
smallest
denot
case
get
grid
le
name
without
class
next
mean
larg
path
arr
gener
new
109
largest
remain
sinc
modulo
within
5
cell
4
last
appear
contigu
way
substr
lowercas
numsi
set
second
ii
point
c
tabl
current
step
target
even
guarante
delet
object
perform
greater
reach
singl
connect
--
consecut
edg
inclus
input
condit
place
add
origin
rule
replac
function
design
primari
allow
assum
schema
sql
test
english
direct
subarray
subsequ
id
becom
game
respect
check
lead
increas
space
longest
howev
distanc
group
alway
label
includ
repeat
product
concaten
four
10
strictli
top
non-neg
6
could
satisfi
notic
9
divid
obtain
requir
appli
amount
maxim
day
play
whose
score
person
would
void
formal
go
squar
final
complet
duplic
convert
calcul
swap
mani
occurr
ascend
pick
data
link
turn
determin
accept
odd
occur
search
algorithm
child
graph
separ
task
xi
varchar
jth
part
insert
lexicograph
visit
ai
addit
answeri
process
palindrom
numsj
line
let
structur
nums1
absolut
coordin
present
minim
ad
like
describ
begin
split
still
correspond
smaller
previou
solut
divis
head
bi
8
r
cost
fit
build
val
represent
locat
output
yi
good
run
shortest
round
arri
travel
null
continu
32-bit
price
alphabet
bottom
directli
permut
made
nums2
report
imposs
optim
edgesi
peopl
rearrang
alic
base
z
modifi
accord
common
arrang
bit
creat
numslength
sign
among
averag
unit
boolean
citi
inform
infinit
stop
non-decreas
assign
construct
shown
highest
undirect
alreadi
leaf
revers
color
height
except
kth
player
chosen
side
decim
goal
along
si
solv
vertic
1-index
partit
rotat
uppercas
none
actual
finish
whether
problem
plane
map
long
u
cover
read
travers
special
match
p
receiv
specif
outsid
subset
bob
horizont
100
diagon
custom
prefix
neg
simultan
code
corner
minut
constraint
board
forward
level
never
area
abc
back
store
stand
complex
entir
11
meet
parenthesi
know
lower
written
limit
lowest
interv
flip
keep
decid
come
parent
select
pa
instead
togeth
12
water
date
system
subtre
tie
user
transform
append
ab
l
collect
stone
method
rel
employe
an
win
13
twice
suppos
iii
frequenc
express
front
built-in
circular
bst
third
immedi
pleas
comput
deriv
cycl
e
10-5
increment
decreas
put
extra
east
belong
overlap
walk
per
closest
work
25
support
land
see
01
mat
correct
achiev
altern
neighbor
n-1
bottom-right
divisor
descend
26
max
pass
col
longer
exceed
found
best
done
21
full
necessarili
said
intersect
insid
prime
queriesi
backward
nth
15
middl
center
taken
pattern
s2
s1
invalid
upper
share
buy
xor
22
item
v
arr1
4-direct
rectangl
larger
text
fill
leav
hold
trail
ask
leftmost
weight
30
parenthes
certain
sever
road
20
friend
top-left
stay
money
arrj
multipli
arrlength
state
box
rest
wordsi
arriv
evalu
wall
23
floor
print
similarli
properti
compani
sell
greatest
90
mention
ansi
seat
dictionari
show
bitwis
encod
west
x-axi
lose
queue
provid
toward
pointsi
wait
stack
non-overlap
might
break
1st
refer
vertex
vi
50
sentenc
jump
open
student
width
clockwis
around
caus
40
ri
north
south
profit
program
destin
constant
random
depth
arr0
combin
17
updat
network
file
pay
version
hour
subtract
give
foreign
salari
frequent
merg
degre
fewer
fn
32
16
pointer
123
power
happen
event
lie
kind
block
14
numer
moment
19
reconstruct
w
languag
circl
success
h
speed
higher
tri
27
leetcod
room
push
abcd
nums1i
ui
06
shape
onto
suffix
nums0
pile
imag
log
winner
balanc
iv
segment
due
reorder
bidirect
plu
face
nearest
00
endi
starti
boundari
triplet
schedul
period
fall
beauti
arithmet
05
mark
2nd
3rd
factor
vowel
doubl
2n
close
rate
pricei
transact
numsk
reduc
38
singli
avail
sit
red
blue
enter
car
etc
stock
28
request
piec
us
ident
independ
top-right
gridij
robot
f
29
37
help
simul
shift
choic
anywher
later
restrict
reachabl
free
09
pop
24
card
island
34
sequenti
33
content
similar
sourc
x1
x2
1000
arbitrari
high
o1
pricesi
03
candi
hand
41
userid
drop
rank
copi
timei
fromi
toi
cut
47
instanc
rectangular
36
fix
anagram
07
cours
quantiti
radiu
18
45
white
distribut
iter
ignor
231
101
say
exclud
ancestor
hous
equival
manag
team
non-zero
recal
arrarrlength
olog
75
73
ensur
bottom-left
recurs
magic
stream
execut
much
x-i
c1
gain
-x
occupi
eat
rightmost
activ
individu
thu
movement
probabl
46
num1
num2
60
capac
plant
43
definit
record
coin
futur
a2
preced
02
low
well
g
obstacl
compar
affect
figur
04
border
0th
35
104
half
bank
endpoint
49
triangl
eras
job
fulli
paint
access
judg
str
tile
48
decod
across
memori
symbol
built
axis-align
year
nums2i
intern
preorder
explan
amongst
librari
parallel
sold
arr2
runtim
straight
manner
absx
factori
partial
compris
alloc
other
draw
underlin
wikipedia
lefti
queriesj
happi
randomli
42
trip
small
handl
associ
previous
latest
slength
worker
black
attend
seri
noth
39
57
80
bool
321
andor
garden
dot
surround
view
shop
cardin
field
answer0
answer1
enough
world
competit
pairsi
broken
word1
word2
vice
versa
linear
instruct
video
exact
median
five
79
97
68
aa
nest
4th
shuffl
public
opposit
chunk
specifi
sale
cross
ball
c2
pilesi
62
convers
in-plac
tasksi
li
nums2j
89
82
flower
downward
99
r1
stonesi
answerlength
59
132
64
repeatedli
entri
food
huge
denomin
signific
rout
31
analysi
street
regardless
78
nodev
repetit
paramet
plan
44
wrap
08
54
countri
bound
met
doesnt
messag
fraction
treat
els
capit
grow
neither
ci
email
phone
vari
earliest
92
righti
social
medium
book
non-increas
enum
unless
intervalsi
complement
010
particular
lost
procedur
skip
135
outgo
abl
automat
simpl
age
69
mountain
74
address
83
produc
110
011
serial
environ
counterclockwis
miss
depend
pushint
standard
press
real
sub-array
depart
offic
sj
positioni
fibonacci
84
whole
85
earn
employeeid
intermedi
truncat
1234
frog
rememb
-3
restaur
threshold
far
necessari
expect
rowi
keyboard
shorter
answerj
thread
forev
93
mod
addint
productid
chessboard
cach
recent
local
hi
88
querieslength
relat
usual
67
a1
phrase
unlock
lock
y2
y1
qualiti
valuesi
away
77
001
hhmm
0000
touch
clear
timestamp
import
95
234
daili
onlin
question
spread
yield
formula
zigzag
display
500
96
ladder
dash
outer
error
interpret
root-to-leaf
term
slice
secur
98
k-th
numsi1
spend
constructor
87
compos
appl
rain
weighti
exam
freeli
command
drive
53
roadsi
websit
project
millisecond
91
52
81
permi
perm
reus
absi
candid
24-hour
-231
q
unoccupi
xth
ban
endtimei
starttimei
endtim
235
starttim
night
rob
alert
buffer
normal
exchang
kilomet
loss
dist
overal
tournament
die
223
costi
attempt
slide
suppli
equat
composit
safe
dollar
perimet
72
statu
fourth
mathemat
flatten
reformat
wordslength
55
script
70
termin
section
bi-direct
pivot
pi
maintain
456
71
getint
interest
min
discount
percentag
river
searchword
unfortun
recov
submatric
beyond
stick
visibl
simplic
filter
idi
yellow
titl
unknown
domino
guard
resulti
coli
hello
past
less
parenti
self
action
logsi
statement
ticket
startpo
bracket
productnam
sub
nums1length
indicesi
210
plot
violat
unabl
x-coordin
disjoint
forest
r2
destroy
station
indirectli
aj
effici
prerequisit
avoid
univers
perfect
y-coordin
effect
vj
uj
ace
summat
1th
identifi
machin
super
ham
folder
hidden
y-axi
bad
span
green
durat
whenev
infect
testcas
monoton
engag
76
therefor
reject
tupl
eventu
disconnect
float
wordsj
86
61
58
heighti
topmost
arrk
member
excel
situat
proven
strang
detect
255
ugli
nice
instantan
108
carri
earlier
window
-2
xy-plan
ever
pathsi
xj
yj
send
login
numi
63
counter-clockwis
sent
customerid
resolv
basic
track
i-th
account
66
known
integr
secret
65
evenli
alphanumer
domain
arrow
nine
particip
400
hasnext
simpli
api
tower
leetcodecom
diagram
net
main
minu
look
pickup
125
vote
cpu
idl
profiti
robber
contact
besid
polic
expans
ring
principl
lucki
disti
speedi
upcom
trivial
chain
interfac
puzzl
wast
offer
non-intersect
mini
customersi
exit
serv
abil
94
dequ
double-end
solutionint
strength
300
spell
button
train
ride
mm
357
filetxt
dont
attribut
care
inord
aforement
preserv
xi1
xn
putint
hash
pars
retriev
token
notat
bought
122
candiesi
submatrix
anyth
089
clock
distancei
attain
movi
2020
seq
aab
gap
school
checker
012
disappear
whitespac
extend
server
height-balanc
flight
275
depict
amounti
s3
wi
nums2length
deepest
uncommon
counter
linked-list
criterion
password
paper
numsright
numsleft
though
prefer
positionsi
tallest
align
peoplei
acycl
session
180
mirror
unroot
transit
disturb
forc
pool
flood
an-1
a3
colorsi
sometim
tripl
b2
bookint
calendar
typic
prerequisitesi
numcours
subject
wherea
mous
eaten
desir
unlimit
journey
re
f1
throw
variabl
coeffici
comma
312
2359
0-base
decrement
quot
valuei
wide
attack
reset
graphij
111
fifth
outcom
fx
lodash
deep
better
compil
unsign
fnarri
s0
546
ten
reserv
basket
2-d
boardrc
prepar
in-ord
arrivali
timesi
difficulti
consum
poor
live
mutat
non
str1
str2
decrypt
star
56
bar
costsi
targeti
numsnumslength
death
dy
birth
dead
col1
row2
row1
col2
sheet
via
short
even-index
odd-index
51
key-valu
bag
children
matter
mine
root2
root1
loop
involv
volum
elev
join
345
servic
load
acb
1101
unsort
arr2j
arr1i
detail
obstaclesi
euclidean
i1th
invers
popul
numsn
collid
collis
halv
3sum
captur
targetsum
experi
075
half-open
451
512
examin
regular
025
cant
owner
paid
seven
run-length
bitwise-xor
imagin
someday
devic
relationship
escap
simplifi
graphi
subgrid
po
102
warehous
0100
exclus
eight
274
balloon
1-9
242
120
variou
temperatur
hire
sk
knight
chess
matij
compress
char
pariti
cancel
bloom
valsi
afterward
promis
enhanc
wish
six
bu
postord
cube
xore
fuel
transfer
64-bit
xy
slot
diff
900
peak
di
p1
invert
a0
ax
save
vice-versa
favorit
pyramid
incur
cherri
463
shifta
smart
parti
strategi
exercis
predict
pascal
cooldown
134
orient
your
entranc
thief
realiz
068
grammar
rx
e2
e1
096
union
rear
isful
isempti
fifo
053
643
picki
charg
elimin
scoresi
older
626
agesi
conflict
250
roll
major
535
641
289
cba
interact
wrong
095
266
personid
lcm
470
compon
packag
478
solvabl
368
ant
503
wooden
476
maxi
idx
serializationdeseri
deseri
transmit
inputoutput
ground
wheel
runningcost
sensit
399
nativ
peekpop
bulb
switcher
131
unari
bridg
toggl
multi-dimension
625
deepli
floating-point
yyyy-mm-dd
507
awesom
two-dimension
photo
wonder
217
fibonacci-lik
xi2
pj
insertint
540
498
redund
rootval
removekey
departmentid
managerid
inner
106
logic
operand
bill
percent
soldier
weakest
strongest
boomerang
chose
529
keysi
536
471
angl
389
maxdist
ratingi
648
287
februari
seqlength
seqi
groupsiz
list1
list2
114
488
1001
numsk-1
0124567
4567012
heightsi
erasur
hit
brick
restor
forgot
non-nul
gold
placement
537
descript
furthermor
640
nums0i
267
commun
226
held
ticketsi
tic-tac-to
movesi
pend
gridrowicoli
fruit
fruitsi
mode
514
single-thread
382
orderd
269
354
well-form
rectanglesi
281
528
aebdc
aeb
373
strong
299
citat
publish
citationsi
h-index
research
cite
impli
foo
leftright
ki
218
organ
farmland
smash
instal
147
145
gridi
len
backspac
296
editor
stationsi
603
460
limitj
s1i
627
12345
pixel
a4
obey
x3
edgesj
bj
si1
eee
applic
unrev
reveal
decki
deck
605
fulfil
colsum
452
221
song
roomsi
353
teacher
teach
356
295
bomb
611
chees
523
397
finger
layout
maxtim
timej
cat
t2
t1
sumrangeint
numarrayint
numarray
immut
biject
tank
ga
thrown
stonevalu
206
487
649
547
461
375
prepend
sn
nextint
encount
verifi
quotat
keyi
vii
words1
words2
457
sure
enemi
poison
293
malwar
miniti
saleid
070
220
232
defeat
engin
devis
json
numrow
java
600
200
379
222
5th
0110
0-9
567
366
213
386
cinema
context
367
071
520
477
connectionsi
extract
633
517
curr
n2
snake
hole
metal
stage
purpos
dial
door
141
278
uniformli
467
502
mid
got
everyon
bipartit
chalkboard
632
cook
chef
116
infin
tilesi
079
481
508
quarter
tonight
stash
profession
513
memoiz
pig
fed
bucket
liquid
feed
ye
parser
expectednumsi
expectednum
assert
thing
expectednumslength
drawn
slant
worri
sake
bash
one-lin
092
329
doubli
390
unequ
475
4sum
nums3
fee
treenod
seatsi
numsnumslength-1
639
absnumsi
numsindex
081
summer
358
someon
kingdom
king
successor
fair
searchint
layer
behind
faster
cc
609
abbrevi
molecul
printer
148
091
upper-cas
hexadecim
ip
ipv4
biginteg
driver
gridrc
maxsiz
trap
073
unchang
360
url
port
weightsi
ship
545
021
targetword
0001
619
critic
arr1length
sourcei
yet
interfer
info
decomposit
pointslength
0190
ahead
mile
climb
staircas
233
wordlength
630
211
stationari
208
227
histori
region
392
themself
509
datetim
sea
lot
natur
space-separ
queen
contour
surfac
skylin
511
flat
incomplet
dimens
370
615
cab
conveni
studentid
280
xxxx
biggest
117
550
polygon
resid
convex
redistribut
sij
527
k-sum
248
growth
analyz
tell
541
asynchron
621
492
eval
bring
ansj
458
465
gcd
playerid
deviceid
eventd
gamesplay
eventsi
376
subordin
categori
incom
624
239
glass
truck
assort
391
respons
delay
signal
130
non-leaf
140
elaps
dag
525
frame
201
switch
asteroid
203
groupi
legal
old
refil
plantsi
2x
watch
protect
singly-link
486
105
496
124
tire
val2
val1
521
vp
614
depthb
maxdeptha
deptha
vpss
asterisk
peek
cj
249
indirect
row-wis
fashion
ch
283
speciali
rent
lr
483
302
burst
499
240
129
sub-box
sudoku
103
skill
app
tweet
advanc
ascii
budget
worddict
466
115
4237214
startcol
startrow
094
tripsi
passeng
lake
080
left-to-right
000
2-dimension
cheapest
491
f3
629
f2
furthest
078
243
346
searchstr
380
option
h2o
partner
uninfect
385
202
290
nums2i1
542
i1
i0
numsd
numsb
numsc
quadruplet
numsa
482
497
subgraph
622
fanci
labelsi
lower-cas
sub-tre
579
059
374
606
k-1
286
128
455
self-edg
answerx
retain
224
207
1d
620
395
matrixrowcol
mail
summari
matrixij
526
637
074
numsr
numsl
nums1j
383
054
260
deliveri
515
shot
oppon
expir
133
alength
correctli
guess
took
dominoesi
256
381
restrictionsi
146
144
544
armi
energi
non-digit
ccc
colj
rowj
diamet
tape
transpos
costij
ycenter
xcenter
resourc
contamin
631
callback
tail
encodedi
prove
liter
138
requestsi
startvalu
lca
646
finit
mass
uniform
argument
shouldnt
453
3d
601
weak
cyclic
325
rightward
upon
mix
150
page
develop
housesi
freq
browser
race
801
803
551
node2
node1
642
351
big
shiftsi
activitytyp
non-spac
reward
531
276
261
hh
608
3n
ratio
262
ij
288
p2
itemsi
363
circumfer
an-2
ingredi
obstruct
fewest
endword
beginword
wordlist
636
493
p0
newnum
newnumsi
single-spac
clone
laser
piecesi
insertstr
flowersi
284
bac
egg
unbroken
certainti
struct
pref
articl
rise
1100
ix
roman
xii
iiii
xxvii
xx
1010
concept
triangular
listinteg
530
365
bc
616
genet
great
anti-clockwis
pizza
462
contest
396
-5
-9
444
blength
10000
359
484
market
rangesi
2510
121241510
bug
518
246
617
209
carpet
carpetlen
fi
1-base
seed
090
stamp
home
maze
tx
sx
ty
sy
batch
remind
251
139
parent0
610
009
040
844
shiftc
shiftx
shiftsi-1
dire
announc
round-bas
radiant
dota2
victori
senat
rowindex
rowindexth
673
719
tour
directly-link
thieveri
almost
072
abefh
rabc
ra
rw
ek
acdfh
cartesian
abdfh
rabcdefgh
re2
singleton
abefg
acadbcbd
acefg
rexpr
understood
comma-delimit
brace
abdfg
acdfg
acefh
re1
rabbc
rabcd
benefit
enqueueint
mycircularqueu
dequeu
mycircularqueuek
hhhvv
hvhvh
921
monster
weapon
chargeth
defend
younger
basketbal
multiplicand
introduc
dice
rollmaxi
rollmax
449
cousin
bcad
predecessor
wordb
048
wordk
worda
abac
word3
submiss
circumv
mountainarray
mountainarraylength
mountainarraygetk
mountainarrayget
mountainarrgetindex
mountainarr
disqualif
mn
sqrt2
lastnam
addressid
firstnam
123450
supplier
size-4
8-5
boxesj
4-2
size-8
packagesi
size-2
889
4-3
size-5
size-3
minlength
non-prim
verbal
307
plank
bitset
tostr
fixint
coincid
compactli
bitsetint
166
unfixint
approach
creativ
clarif
gondola
599
centenni
scenario
boardingcost
bval
aval
026
574
2-1
last-in-first-out
lifo
mystack
rect
rectsi
spellsi
potionsj
potion
3k
994
328
abcc
floornumsi
862
arrayflat
870
commut
107
apr
30th
feb
oct
2100
jan
sep
aug
jul
dec
nov
month
1900
31st
mar
yyyi
dd
jun
961
greed
cooki
gi
there
tenth
explor
possibilities95
10th
advantag
bottomright
isleaf
understand
bottomleft
wiki
signifi
quad
topright
topleft
quad-tre
sub-grid
proper
5489355421
5489355214
5489355142
5489355241
smallest-valu
5489355412
850
895
971
149
chip
161
orderedstreamint
ddddd
orderedstream
osinsert5
o
valuelength
aaaaa
concatent
osinsert4
insert656
osinsert2
bbbbb
orderedstream5
osinsert1
osinsert3
idkey
ccccc
eeeee
425
constrain
rootrightv
minrootleftv
sub-nod
myhashmap
hashmap
earner
30000
978
subexpr
subexpr2
subexprn
subexpr1
minstack
getmin
polish
subtot
productj
purchas
groceri
supermarket
productsi
cashierint
amountj
getbillint
cashier
361
rightchildi
leftchildi
5674
5678
1238
pangram
832
civilian
weaker
337
684
268
suggest
treesi
treesj
932
037
019
loweri
higheri
statusi
298
initialbox
containedbox
containedboxesi
row1i
matxi
col1i
queryi
row2i
col2i
modif
fixed-length
arrm
-7
stronger
344
13254
uniquely-s
866
846
absarri
2k
veganfriendlyi
333
veganfriendli
maxpric
vegan-friendli
restaurantsi
inventoryi
weirdli
diminishing-valu
inventori
343
movieid
341
movier
createdat
review
027
937
pointsrc
absc1
groupsizes1
282
groupsizesi
647
splice
324
sentencesi
2314
84351
tromino
numsk1
prior
numsn-1
annual
051
expectedi
koko
love
slowli
bananas-per-hour
banana
gone
stabl
hitsi
sentence1
sentence2
jane
813
416
end-nod
athlet
silver
bronz
medal
scorei
notepad
screen
necesssarili
side-length
292
sumsecond
163
sumfirst
fnval
init
fninit
arrayreduc
childi
descriptionsi
196
islefti
conver
maxarr0i
converi
uam
817
behaviour
spaghetti
philosoph
think
putrightfork
fork
dine
starv
disciplin
pickrightfork
stomach
demand
wikipediaorg
bowl
putleftfork
pickleftfork
wantstoeatphilosoph
concurr
silent
lexic
itinerari
departur
airlin
airport
jfk
lgb
man
lga
toe
tac
tic
harvest
numsx
913
numsz
numsw
nextvis
997
nextvisit
wildcard
kthlargestint
kthlargest
succprobi
1e-5
963
act
834
processingtimei
instantli
enqueuetimei
hesh
510
removequeri
removequeriesi
327
productcategori
408
arrlen
558
573
967
maxlen
725
982
findsumpairsint
865
findsumpair
nums2index
countint
tot
001112
955
contrast
0120
668
k-repeat
169
lfucach
lfu
lfucacheint
no-adjacent-flow
flowerb
l0
l1
l2
ln
maxlocalij
maxloc
aba
155
mainli
printthird
printsecond
printfirst
mechan
seem
comprehens
700
sandwich
lunch
studentsj
cafeteria
sandwichesi
brush
sidelengthi
freez
454
hj
queuej
kj
queue0
557
986
sessiontim
fizzbuzz
fizz
buzz
four-direct
4-length
hectar
m-1
992
049
corridor
decor
uncolor
alon
10-6
1j
cursor
cursorrightint
cursorleftint
deletetextint
addtextstr
min10
cursorposit
currenttextlength
texteditor
446
pre-exist
sanction
govern
coinsi
presenc
121000
102001
finalsum
178
qj
disi
697
edgelisti
edgelist
658
384
symmetri
cde
061
acd
s2i
basestr
reflex
eed
re-us
maxchoosableinteg
desiredtot
sound
eetcod
490
soul
cool
delight
sc
imageij
imagesrsc
sr
721
xk
857
feel
stretchi
oo
heeellooo
lllll
helloo
hiiii
helllllooo
hellooo
extens
ooo
377
unvisit
colsumlength
rowsum
rowsumi
colsumj
rowsumlength
925
259
965
mycalendarthre
k-book
edit
listen
music
playlist
boredom
110100010
869
changeratingstr
highestratedstr
foodrat
cuisinesi
ratingsi
highest-r
newrat
foodsi
foodratingsstr
cuisin
331
subjectid
teacherid
taught
deptid
operationsi1
operationsi0
felt
bombsi
deton
reward2i
reward1
mice
reward1i
reward2
evil
320
cxbae
cabx
ba
717
cabxba
065
ccatmmous
mousejump
728
catjump
aec
685
sumnumsi-numsj
057
remaind
tn1
137
tn2
n-th
tn3
t0
tn
tribonacci
px
circuit
gasi
resrc
res0n-12
resr1c-2height-r-1
2height1
resr1c2height-r-1
f0
commonli
employeeuni
uniqueid
378
563
wash
dress
2d-array
therer
339
xvalu
987
namesi
977
wrote
seper
736
rec1
rec2
director
directorid
actordirector
050
actorid
actor
cooper
1235
min2
12335
instructionsi
1233344
trimmedsubarraylength
trimmedsubarray
trimmed1233344
33344the
trimmed312434
3434
flipsi
prefix-align
judgement
2th
findmedian
addnumint
medianfind
oon
incstr
getminkey
getmaxkey
decstr
allon
ca
aca
abaca
364
stockspann
73412
7212
today
934126
sentinel
comma-separ
x0
most-significant-bit
018
least-significant-bit
knowledg
nameisageyearsold
knowledgei
807
zuma
variat
minjump
maxjump
871
085
timer
timeseri
teemo
hero
ash
timeseriesi
434
hatsi
wear
hat
10111
endi-1
pairslength
097
num1num2
winneri
matchesi
225
loseri
functionid
fint
customfunct
findsolut
fxi
237
callabl
jobsi
723
isequ
o2
jsonpars
628
paypalishir
convertstr
font
pahnaplsiigyir
legibl
-1073741825
streak
501
withdraw
atm
banknot
banknotescount
241
priorit
withdrawint
deposit
depositint
blocksi
recolor
inspect
001101
offici
varieti
truthi
arrayfilt
634
1110
out-of-ord
726
5247
queryindic
querycharactersi
lengthsi
queryindicesi
querycharact
reservedseat
reservedseatsi
four-person
aisl
workersj
pill
spiral
cstart
northwest
southeast
rstart
cbad
buddi
319
ethernet
cabl
valley
hill
non-equ
315
even-valu
grandpar
jsonstringifi
objectkey
645
tasti
stuck
706
redirect
boustrophedon
-14-13
mincurr
style
boardn
6-side
df
depth-first
028
fallout
keyword
quest
anticlockwis
1200
engrav
freedom
recharg
batteriesi
batteri
special-equival
zzxi
xzzi
xyzz
ballsi
freed
freeint
allocatorint
allocateint
mismatch
dislik
dislikesi
022
01101
aecdb
bbcbaa
657
aacabb
csum123
practic
sum123
curri
satisfact
discard
satisfactioni
402
dish
like-tim
952
lockedi
505
291
targetfriend
leavingi
chair
942
letter-log
digit-log
space-delimit
244
saled
sellerid
2019
unitpric
buyerid
2019-03-31
2019-01-01
084
ac
ababbc
abcbabcbcb
415
baa
fib
fibn
factorialn
623
allot
surviv
minutestodi
minutestotest
isconnectedij
isconnect
provinc
student-mentor
survey
compat
studentsi
947
mentorsj
mentor
ampersand
gt
slash
apo
amp
lt
410
html
entiti
frasl
xn-2
xn-1
neccesarilli
warrior
wrr
widths0
result1
result0
widths1
594
kept
removeduplicatesnum
unix
pipes92
sunni
wordstxt
supersequ
-k
mat31
mat42
mat20
309
addattailint
prev
addatindexint
indexth
addatheadint
deleteatindexint
mylinkedlist
pointerrefer
non-star
pairwis
046
heaviest
firstlen
031
secondlen
nums4l
nums4
nums3k
340
928
passingfeesj
passingfe
cbtinsertertreenod
cbtinsert
getroot
alex
middleindex
numsmiddleindex-1
numsmiddleindex2
numsmiddleindex1
991
-10
maxsum
802
swelter
ice
cream
boy
833
wordsjk
unusu
traversing-ord
circularli
kjf
11106
a-z
aajf
birthstr
kingnam
well-defin
curord
throne
parentnam
successork
inherit
jack
son
who
successorx
successoralic
throneinherit
oldest
throneinheritancestr
getinheritanceord
grandchild
deathstr
born
successorjack
gave
successorbob
childnam
famili
colrow
194
rth
col1row1col2row2
alices
bobsizesj
bobsiz
alicesizesi
or
skiplist
eraseint
ologn
kalinin
idea
fine
by-sa
httpsenwikipediaorgwikiskiplist
treap
wikimedia
red-black
artyom
304050607090
576
2h
even-odd
nucleotid
acgaattccg
studi
dna
10-letter-long
targetgrid
591
targetgridrowcol
solid
usa
googl
usag
8-direct
422
rotten
doctor
applesi
705
rot
daysi
2001db885a3008a2e03707334
20010db885a38a2e037j7334
x1x2x3x4x5x6x7x8
192168011
x1x2x3x4
xilength
queryip
020010db885a3000000008a2e03707334
ipv6
19216811
19216810
20010db885a3000000008a2e03707334
192168100
bobvalu
bobvaluesi
alicevalu
686
alicevaluesi
262124
945
zbax
154
exce
lru
evict
lrucach
lrucacheint
gridrowcol
034
capacityi
279
rocksi
rock
additionalrock
typewrit
974
odd-valu
252
236
revnumsi
revnumsj
814
revx
rev120
rev123
minesi
gridxiyi
arm
relev
305
endlessli
numsnumsi
920
zero-bas
seq0
seq1
numsseqj
forwardbackward
seqk
968
numsi-1
minsiz
maxlett
297
737
heightmap
queu
216
694
firstli
non-coprim
197
gcdx
companion
encodedecod
shorturl
encodestr
longurl
tinyurl
decodestr
httptinyurlcom4e9iak
httpsleetcodecomproblemsdesign-tinyurl
tini
shorten
maxbox
portsi
boxesi
maxweight
storag
deliv
687
portscount
scoreij
preferencesi
583
unhappi
880
secondword
firstword
969
0011
2p
1111
004
mindist
058
maximaminima
k1
k2
301
up-left
441
progress
916
prevroomi
prevroom
prevroom0
coloni
arr2length
835
macro
comment
newlin
control
implicit
f1content
f1txtf1content
directori
fntxtfncontent
fncontent
rootd1d2dm
f1txt
f2txtf2content
f2txt
fntxt
directorypathfilenametxt
f2content
-y
human
stadium
traffic
visitd
pid
subtext1
subtextk
subtext2
subtexti
042
pointsj
countj
718
0156
slow
catch
fleet
bumper
one-lan
slower
stair
bacd
cbda
startword
acbd
global
leetcodeproblem
filesystem
folderj
folderi
sub-fold
847
sizei
minsizej
preferredj
absid
hotel
roomidi
worddictionaryaddwordbad
nullnullnullnullfalsetruetruetru
worddictionaryaddwordaddwordaddwordsearchsearchsearchsearch
worddictionarysearchpad
worddictionarysearchad
worddictionaryaddwordmad
worddictionarysearchbad
baddadmadpadbadadb
search11
addword
worddictionaryaddworddad
addwordword
worddictionarysearchb
worddictionari
anyon
reportsto
731
stack-lik
freqstack
349
cheat
classroom
064
quantitiesi
retail
specialti
deathi
854
aliv
birthi
bce
cae
new2
160
2932
new1
brokenlett
935
malfunct
properli
secondari
572
directionsi
motion
memory2
faulti
860
crashtim
memory1crash
memory1
leak
memory2crash
crash
063
super-palindrom
sub-sequ
566
count-and-say
3322251
countandsayn
countandsay1
countandsayn-1
936
rung
pos1x
179
pos2x
pos1i
pos2i
pos2z
pos2v
pos1z
pos1v
zeroevenoddint
consol
zeroevenodd
010203040506
zeroprintnumb
oddprintnumb
evenprintnumb
printnumb
printnumber7
decryptstr
encrypterchar
permit
encryptstr
encrypt
424
descent
exempt
smooth
defus
652
coden-1
code0
285
xs
os
colconditionsi
belowi
rowcondit
abovei
colcondit
rowconditionsi
xxx-xxx-xxxx
456-7890
xxx
987-123-4567
456-789093
7890
xxx-xxxx
golf
agex
agey
appropri
890
experienceyear
projectid
mycalendar
002
flow
atlant
ocean
pacif
heightsrc
808
primefactor
milestonesi
mileston
953
week
xqueeni
queensi
yking
xking
yqueeni
buildingsi
silhouett
x1y1x2y2
geometr
cuboidsi
lengthj
lengthi
widthj
691
cuboid
widthi
heightj
976
infrastructur
mors
studentnam
subjectnam
946
changenumi
90-degre
886
910
abbxxxxzyy
bb
yy
purpl
rhombu
878
247
s2j
12345678987600000
presuf
suf
1234554321
1234567
pre
presufec
1234589876e5
1234567654321
264
3-same-digit
monkey
897
soup
ml
sxi
compact
patientnam
patientid
patient
diabet
hospit
diab1
219
acceptd
accepterid
requestaccept
requesterid
differencei
wordsij
differenceij
wordsij1
equal-length
005
negat
-numsi
averageamount
visitedon
jewel
blacklist
88855
3825
rleiteratorint
281825
rleiter
encodingi
exhaust
380925
rle
442
sleep
milli
923
subpath
823
jobdifficulti
335
jobdifficultyi
882
prioriti
tasksj
serversi
rcenter
ccenter
030
powx
rais
727
153
logarithm
duti
securityi
gang
043
verticalcut
verticalcutsj
horizontalcut
horizontalcutsi
cake
998
gcdnumsi
703
addrangeint
rangemodul
modul
queryrangeint
removerangeint
enddayi
startdayi
702
y
00010
00001
10010
news
informtimei
manageri
managerheadid
headid
urgent
50000
907
monthli
20000
accountid
707
maxnumsj
mi
realimaginaryi
-100
i2
imaginari
12321
garbag
garbagei
trave
n1
bold
abcabcabc
abdbec
pricesj
twin
n-1-ith
brainpoweri
brainpow
decis
questionsi
ghostsi
ghost
xtarget
ytarget
pac-man
549
addpatch
patch
post
3456
0158
3951
6345
sleft
sright
568
minh
mht
meetingsi
firstperson
returnedarrayi
635
arraymap
mud
underneath
digi
artifactsi
c1i
c2i
buri
artifact
dig
r1i
r2i
excav
uncov
unidirect
192
423
cardpoint
recur
enclos
coupl
averagea
averagearr
averageb
explod
beforeitemsi
099
worst
invoc
tracker
addstr
invok
attract
sortrack
ordin
scenic
958
cmove
rmove
putnewi
righttolefti
lefttorightj
regul
532
righttoleftj
lefttorighti
pickoldi
orderli
earli
nummov
k-distant
1002
0-11
led
0-59
pm
turnedon
741
1440
spent
intim
eventday
outtim
empid
leaveint
examroomint
examroom
peculiar
incorrect
012345
crack
bth
ath
669
hisher
alicebob
capacitya
can
capacityb
battleship
k-similar
393
stocknam
operationday
gainloss
well-perform
non-tir
245
depthc
10101
394
somewher
mask
10-13
-xxxx
0-3
bookshelf
shelfwidth
shelv
booksi
thicknessi
shelf
thick
bookcas
myqueu
352
queriesith
intlength
employeesiimport
employeesisubordin
employeesiid
allowedswapsi
722
allowedswap
encodedtext
originaltext
cipher
transposit
pr
ciphertext
by1
rectilinear
bx2
by2
ax1
ay1
ay2
ax2
bx1
img
smoother
grayscal
61741
664
6141
6741
6174
skl
960
1221121221221121122
relax
371
695
alal1ar
12344
585
14234
treeancestor
treeancestorint
getkthancestorint
wise
graph1
grapha
minb
x-valu
pen
pencil
cost1
utensil
cost2
pseudo-palindrom
020
enclav
195
2-row
0-thupper
column0-index
1-stlower
colsumi
253
437
bean
171
storekeep
263
rod
color-posit
r3g2b1
suffici
people1
people0
people3
reqskil
683
tweetid
688
318
maxcost
ti
reiniti
806
permn
2-9
telephon
omit
one-to-on
foobar
printfoo
printbar
713
14312
1412
numpassengersi
vehicl
dri
anslength
rainsi
rainslength
insuffici
version2
revis
2533
version1
ambigu
extran
205
minprofit
crime
commit
scheme
679
src
flightsi
dst
sub-island
grid2
905
grid1
chemistri
skilli
fnx
gx
fghx
hx
acquir
neededappl
954
469
3200
kelvin
fahrenheit
celsiu
27315
builddictstr
magicdictionari
meter
distance2
distance3
distance0
distance1
voter
position-on
403
extracandi
431
kid
commissionr
commiss
comid
salesperson
hired
salesid
alongsid
orderid
830
448
468
553
kitchen
orang
mappingi
191
jumbl
introvert
659
extrovert
introvertscount
extrovertscount
h2o2he3mg4
chemic
h1o2
h2o23
atom
h2o2
orthogon
illustr
qwertyuiop
asdfghjkl
american
zxcvbnm
columntitl
582
lengthwordj
lengthwordi
121
ea
638
2013-10-01
clientid
driverid
role
usersid
unban
client
cancelledbydriv
requestat
taxi
cancelledbycli
2013-10-03
cityid
case-insensit
paragraph
bstiter
bstiteratortreenod
non-exist
platform
popular
viewsi
creatori
idsi
creator
lo
387
k-diff
graphic
nums1i0
nums1ik
ik
minnums2i0
nums1i1
nums2ik
177
592
frontmiddleback
pushbackint
pushmiddleint
popback
670
pushfrontint
popfront
popmiddl
frontmost
044
929
bloomday
bloomdayi
bouquet
less-than-or-equal-to
447
handi
farm
strict
multallm
addallinc
addal
appendv
inc
getindexidx
multal
519
peekingiteratoriteratorint
peekingiter
factoryj
roboti
positionj
repair
typei
loadi
i2th
busi
busiest
spectat
hall
bookmyshowint
scatterint
maxrow
henc
concert
gatherint
bookmyshow
562
self-divid
rededgesi
rededg
blueedgesj
blueedg
2021
reversed1
reversed2
1202
119
12300
everybodi
heightsj-1
heightsi2
944
maxheightsi1
minheightsi
heightsj
ocurr
pattern0
pattern1
runningsumi
sumnums0numsi
480
wallet
mkaverag
mkaverageint
825
mk
calculatemkaverag
addelementint
590
cy
towersi
garbl
cx
qi
deletefront
mycirculardequ
mycirculardequeint
getfront
insertfront
deletelast
getrear
insertlast
needl
haystack
2d-plane
manhattan
584
numselect
cnumselect
time-point
languagesi
friendship
733
friendshipsi
nary-tre
n-ari
962
floorpilesi
floorx
conveyor
belt
alter
k-group
left-out
e-mail
underscor
a-b
datastreamint
datastream
consecint
fullfil
asyncron
matrixxi
845
seatmanag
smallest-numb
seatmanagerint
seatnumb
unreserv
fetch
unreserveint
644
divisorsi
sleftirighti
055
candl
plate
524
efficiencyi
transactionid
mall
visitid
581
922
3245
2582
hamstersi
086
hamster
738
gridm
gridin
1n
grid00
330
abcdefd
dcbaefd
arraylast
prototyp
salaryi
xcentr
centr
ycentr
2d-map
archeri
numarrow
bobarrow
nobodi
shoot
212
bk
alicearrow
ak
cutsi
tokensi
potenti
407
travelleddist
signup
934
confirm
timeout
906
numsliri
52372
485
master
allowedguess
six-letter-long
bruteforc
masterguessword
helper
masterguess
reason
arr2i
arr1j
dominoesj
dominoeslength
314
matrc
answerij
2266622
pressedkey
transmiss
bonu
873
984
pad
diagaram
dialer
404
170
1-bit
2-bit
one-bit
customstackint
incint
customstack
559
556
thousand
204
personnam
kilogram
turn1
turnn
3x3
solver
840
maxheighti
highest-rank
meanwhil
billsi
lemonad
divisor1
uniquecnt1
divisor2
uniquecnt2
n-2
horizontalvert
nn
534
storeroom
cubic
739
wizard
strengthi
ruler
initialexperi
initialenergi
experiencei
energyi
atoi
myatoistr
0032
clamp
bbb
aaa
405
gridrowjcolj
lamp
lampsi
illumin
980
accountsij
wealth
richest
672
wrap-around
stretch
y-direct
xend
xstart
spheric
060
ab121p
cdefghijklmn
arbitrarili
abcdefghijklmnop
startj
minn
696
maximumbit
829
2maximumbit
732
altitud
gaini
biker
hiddeni
differencesi
270
size1
595
size2
401
isinfectedij
model
viru
quarantin
threaten
rapidli
isinfect
569
groupbi
arraygroupbyfn
720
1021
863
sport
stitch
clip
clipsi
024
805
a123bc34d8ef34
noderight
nodeleft
008
lastdayi
coursesi
durationi
pathi
680
589
numsendi
numsstarti
destvalu
step-by-step
543
targetx
criteria
bulki
categor
heavi
irrelev
magnitud
cardsi
rand10
rand7
674
complementari
blank
click
clickr
minesweep
clickc
dart
threw
dartsi
dartboard
bcosti
acosti
interview
029
fli
glue
irregular
season
baaba0
baaabb0
startindex
914
362
bigram
rescu
fight
power-up
threat
health
princess
dungeon
quickli
orb
demon
valiant
imprison
laid
lowlimit
highlimit
742
593
sizet
numst
dynam
959
resiz
croakoffrog
croak
419
rectanglei
yi2
yi1
index-0
web
979
n3
473
neighborhood
12233211
sublist
313
decompress
749
numsr-1
numsl1
absnumsl
181
browserhistorystr
browserhistoryforward2
tab
nullnullnullnullfacebookcomgooglecomfacebookcomnulllinkedincomgooglecomleetcodecom
facebookcom
backint
youtubecom
browserhistoryvisitfacebookcom
browserhistoryvisitlinkedincom
homepag
forwardint
5000
browserhistoryvisitvisitvisitbackbackforwardvisitforwardbackback
browserhistoryforward1
homepagelength
linkedincom
browserhistoryvisitgooglecom
browserhistoryleetcodecom
visitstr
browserhistoryback7
browserhistoryback2
browserhistori
browserhistoryback1
forward472
googlecom
urllength
leetcodecomgooglecomfacebookcomyoutubecom111linkedincom227
browserhistoryvisityoutubecom
releaseoxygen
bond
barrier
oxygen
releasehydrogen
bind
hydrogen
enforc
explicitli
synchron
745
015
acceler
aar
243801
927
243803
12c
caaacab
abccdef
licensepl
insensit
cbca
coordinatesi
arrx
shortestpathint
graphint
addedgeint
edgecosti
edgecost
4253
911
reindex
column-wis
unus
cartyp
parkingsystem
park
addcarint
parkingsystemint
wiggl
nums2i2
nums1i2
nums2k
577
nums1k
shiftt
shiftz
reorient
ministri
narrow
transport
sex
temporari
xayb
cow
hint
bull
non-bul
backsi
frontsi
ryan
3094
made-up
conson
goat
applema
oatgma
latin
sumw
pickindex
wlength
processingtim
661
machineid
processid
arr1i-arr2j
genr
odd-numb
bore
23489
124789
957
0-height
prism
richeri
quieti
richer
quiet
rich
loud
464
numsi-1numsj-1
columns-1
heightsrowcol
hike
hiker
hope
rows-1
effort
feedback
studentidi
reporti
positivefeedback
negativefeedback
wraparound
zabcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyzabcd
abcdefghijklmnopqrstuvwxyz
215
word2length
word2j
word1i
word1length
c3
a2bc3
aabccc
asteroidsi
126
planet
016
safehous
former
grass
fire
258
latter
ping
pingint
3000
recentcount
thorn
todelet
504
fallen
upright
expend
zerosrowi
zeroscolj
onescolj
diffij
onesrowi
routesi
routes0
countinterv
fn-1
fn-2
414
lastli
dest
src2
src1
constitu
735
ni
277
607
k-subarray
well-spac
havent
indiceslength
resolve2
const
650
caught
t50m
t100m
cancellabletask
promiseresolv
settimeoutcancel
promisecatchconsolelog
settimeoutresolv
rowscount
organis
colscount
snailrowscount
snail
306
561
003
tleft
tright
substitut
compet
firstplay
secondplay
mycalendartwo
columnnumb
wagei
wage
qualityi
echo
316
nums-1
rankp
answerrowcol
rankq
985
distinctli
third-largest
second-largest
gate
pricereward
cash
queryint
rangefreqqueri
rangefreqqueryint
arrleftright
838
snapshotarray
snapshot
array-lik
snap
getindex
snapshotarrayint
snapid
setindex
901
logm
om
logn
856
min-product
primit
nonempti
outermost
pk
062
-27335
quotient
dividend
8345
deal
earth
invent
discov
552
rick
morti
c-137
magnet
totaltrip
187
influenc
193
165
operationsi
basebal
items2
items1
ret
reti
690
circlesi
lattic
topsi
bottomsi
007
getvalueint
newvalu
subrectangl
updatesubrectangleint
row2col2
subrectanglequeri
row1col1
rowcol
jumbo
cheeseslic
totalsmal
tomato
burger
totaljumbo
tomatoslic
nextcoursei
relationsi
semest
494
prevcoursei
653
wallsj
unguard
257
guardsi
integer-sid
zx
shadow
yz
3-dimension
airplan
abefcd
efcdab
acdbef
abcdef
efabcd
cdabef
cdefab
functionsi
promisepool
432
varianc
272
beautyi
s4
invertx
reversex
reverseinvertsi
0111001
011100110110001
372
valsk-1
vals0
hashsub
156
vala
vals1
pk-1
valz
hashvalu
minnums2
maxnums2
xr
rxxlrxrxl
xl
lx
033
sunday
herci
monday
716
tuesday
915
ccjjc
abab
receptor
reflect
southwest
ray
cityai
citybi
436
lone
2019-07-27
endsess
activityd
opensess
sendmessag
scrolldown
sessionid
startswithstr
trie
spellcheck
pronounc
dataset
autocomplet
forgotten
adjacentpairsi
adjacentpair
743
662
newflow
caretak
076
requestsj
resultj
bcdea
3bb
evalint
-1a14
4a
-6
-2aaa
5c
aabc
evalvar
well-format
3aab
ipo
pure
ventur
capitali
soon
profitsi
loos
maxpt
overwritten
setkey
inaccess
un-expir
getkey
non-adjac
isomorph
489
mst
pseudo-crit
995
accountsi
accountsi0
i-1th
i-2th
822
signfuncproduct
signfuncx
corpor
bookingsi
lasti
firsti
productofnumbersadd2
integer352
nullnullnullnullnullnull20400null32
productofnumbersgetproduct3
productofnumbersadd3
productofnumbersadd5
productofnumbersadd8
productofnumbersgetproduct4
productofnumbersadd0
overflow
3025423482
30254
getproduct
getproductint
productofnumbersaddaddaddaddaddgetproductgetproductgetproductaddgetproduct
productofnumb
productofnumbersadd4
302548
3025
productofnumbersgetproduct2
3-1-5-9
13579
7777
750
332
265
3-digit
hi1
onlogn
nestedlist
iteratornext
nestediteratorlistnestedinteg
nestediter
iteratorhasnext
pseudocod
logout
logintim
0130
2345
seventh
midnight
logouttim
904
0045
0015
930
length-3
viii
872
sendersi
messagesi
chat
sender
186
statementsij
statementsii
151
truth
suff
wordfilterstr
fstring
wordfilt
graphu
graphv
413
stockpricesi
chart
stockpric
dayi
minij
maxij
fort
fortsi
fortsk
viewdat
articleid
author
authorid
viewer
viewerid
swim
everywher
506
abacba
bcfd
abca
keycard
keynam
keynamei
2351
2251
604
2352
0949
keytim
one-hour
keytimei
key-card
emit
310
arrlefti
arrrighti
randpoint
solutiondoubl
6th
mynumb
type-2
type-1
888
884
combinationiter
combinationlength
combinationiteratorstr
numberofunitsperboxi
trucksiz
numberofboxesi
boxtyp
boxtypesi
710
univalu
farthest
countuniquecharss
countuniquecharst
rentint
912
entriesi
movierentingsystemint
shopi
unrent
moviei
shopj
moviej
listlistinteg
rental
dropint
resj
movierentingsystem
largest-valu
903
828
rj
keyspressedi
tester
keypad
keypress
keyspress
releasetimes0
slowest
releas
releasetimesi
releasetim
newli
valuediff
indexdiff
11001
896
streamcheck
032
querychar
streamcheckerstr
xyz
axyz
n-side
triangul
039
013
candiescount
744
dailycapi
favoritetypei
candiescounti
favoritedayi
pre-ord
sticker
k-beauti
sixth
endpo
autoincr
ideal
bsuffix
asuffix
bprefix
ssuffix
sprefix
aprefix
enjoy
enjoyyourcoffe
coffe
gene
aaccggta
aaccggtt
endgen
investig
startgen
8-charact
delici
meal
711
deliciousnessi
beam
banki
anti-theft
while1
taller
964
recipesi
ingredientsi
recip
heap
nim
img2
img1
translat
729
followerid
cur
323
864
388
indexi
32772
327712
prune
851
883
kmh
hoursbefor
regist
usernam
contestid
favoritei
127
capabl
invit
endstat
getaveragetim
underground
checkout
getaveragetimestr
stationnam
checkinint
chronolog
checkin
undergroundsystem
railway
startstat
checkoutint
numsli1
numsli
numsri
369
isbadversionvers
fail
illeg
sslength
rid
167
conductor
yesterday
weather
recordd
chalki
894
restart
chalk
abe
663
revisit
myhashset
containskey
addkey
hashset
matchstick
matchsticksi
p123m
409
iquerieslength-1
transid
587
transactedon
indices0-index
b1
superclass
618
undefin
xrandom
randomindex
brand
lay
homework
querytim
450
pickupi
deliveryi
pickupdeliveri
xcnti-1
maxmov
subdivid
cnti
xcnti
997010000
130189
gettweetcountsperfrequency348
monitor
103609
tweetcountsrecordtweetrecordtweetrecordtweetgettweetcountsperfrequencygettweetcountsperfrequencyrecordtweetgettweetcountsperfrequ
1069
tweet3
tweetcountsgettweetcountsperfrequencyhour
86400-second
nullnullnullnull221null4
36107209
gettweetcountsperfrequencystr
recordtweet
tweetcount
70129
1010000
6060
tweet30tweet360tweet310minutetweet3059minutetweet3060tweet3120hourtweet30210
3600-second
site
recordtweetstr
60-second
tweetnam
0210
tweetcountsgettweetcountsperfrequencyminut
721010000
tweetcountsrecordtweettweet3
closer
876
selldat
camelcas
023
barcod
distant
barcodesi
sourcesi
targetsi
eeecd
abbc
nums21
nums11
nums2n
nums1n
nums10
879
nums20
439
nummatrixint
sumregion
nummatrix
sumregionint
304
893
837
deviat
675
1232
2234
4616
819
183
licens
key-val
sumstr
mapsum
overridden
417
answersi
rabbit
endtimestamp
1end2
functionidstart
0start3
underli
az
axi
onetwothre
bx
subfold
948
bxi
bw
bz
338
612
arrbannedi
bannedi
712
254
0090
0090089
849
9089
398
maxchargetim
runningcostsi
chargetimesi
chargetim
sumrunningcost
quantityi
655
deadend
006
clumsi
factorial10
clumsy10
favoritecompani
favoritecompaniesi
nearli
superstr
base-10
2-mirror
k-mirror
contrari
base-2
base-k
rather
1412477
leftj
mixj
colori
thin
rightj
half-clos
943
paintingj
145177
segmentsi
sortnum
removeelementnum
actuallength
588
odd-length
multilevel
single-level
currnext
dth
floori
numcarpet
898
removablelength
sremovablei
flength
123456579
ceilnumsi
ceil
ceilval
worth
13024
24130
rook
bishop
056
r-1
c-1
friendsi
watchedvideo
watchedvideosi
311
winston
mysteri
func
funcarr
max6
877
max15
176
n-digit
1337
-22
-23
negabinari
-20
growtimei
planttim
136
planttimei
growtim
self-loop
848
syntax
lisp
lisp-lik
mult
expr
scope
innermost
v1
v2
en
vn
def
bef
dfe
adc
winter
warm
heater
alik
704
406
172
numslot
909
repeatlimitedstr
minalength
182
repeatlimit
numbersindex1
index2
numberslength
index1
numbersindex2
side-view
861
graviti
inertia
upper-left
602
incompat
681
comparison
420
searchcost
leaf-similar
855
arri-1
non-alphanumer
reorgan
667
digitsi
1351315
931
discussleetcodecom
subdomain
rep
count-pair
d1d2
com
d1d2d3
9001
cpdomain
implicitli
minimumi
665
actuali
countsi
rat
art
tar
treenodeleft
treenodeleftv
treenoderight
findint
findelementstreenod
treenodev
findel
treenoderightv
avgsi
avg
k-radiu
941
rever
widest
fixed-width
185
xor-beauti
horizontallyvert
isnt
numwant
uselimit
472
parentsi
nodei
vali
parentsx
938
052
grumpyi
bookstor
throughout
grumpi
techniqu
734
needsi
specialin
specialij
abdc
dacb
273
toeplitz
stampwidth
stampheight
294
827
ologarrlength
patterni
1e5
pictur
champagn
pour
excess
100th
cup
board00
fghij
uvwxi
pqrst
klmno
-255
-55
763
881
654
forbidden
forbiddeni
unord
listnod
bs
entrancecol
926
entrancerow
defens
attackj
defensej
attacki
996
defensei
propertiesi
824
lane
obstacles2
sideway
ans1
157
ans0
678
al
beneath
aesthet
three-lett
433
batchsiz
815
fresh
donut
groupsi
bake
locationslength
locationsi
575
locationsj
numpeopl
gift
penalti
abbca
appeal
no-zero
317
skipb
intersectv
heada
listb
lista
headb
skipa
numsii
159
numsinumslength
uncross
035
non-horizont
retri
robotint
getpo
stepint
await
getdir
069
grade
516
538
411
defang
047
342
190
purchased
startdat
unitssold
enddat
averagepric
036
blockedi
million
038
aaaeeeooo
aeoiu
uaeio
aaaaaaeiiiioou
aeiou
839
812
alicezleetcodecom
myemailcom
aliceleetcodecom
emailsi
everyth
mynameemailcom
mailbox
deci-binari
112
689
3001
1-border
fueli
refuel
startfuel
x1y1x2y2xnyn
x1x2xny1y2yn
539
tiresi
numlap
lap
188
changetim
rix-1
859
this1
is2
sentence4
578
neededtimei
rope
neededtim
topvotedcandid
topvotedcandidateint
qint
cast
personsi
elect
671
981
748
score0
score1
score25
trim
maxm
2m
cellsi
970
cith
rith
701
till
bottom-up
014
valuesj
sightse
spot
sector
560
roundsi
rounds1
marathon
rounds0
circul
punctuat
816
abcba
targetlength
left-most
975
poeplei
warmer
4123
2143
164
4321
693
leadid
partnerid
makenam
dailysal
dateid
rowcost
homecom
homecol
homepo
087
rowcostsr
colcostsc
homerow
colcost
maxdoubl
ordersi
backlog
ordertypei
ordersi1
95m
100m
135m
60m
reciev
50m
400m
debounc
35m
150m
30m
347
boat
598
crawler
text1
text2
143
updateint
mutabl
39916800
f11
preimag
convent
unnecessari
nextlargest
887
reduct
numbottl
drink
numexchang
bottl
3x
045
productkey
apex
farmer
088
bottommost
fertil
barren
under-popul
conway
automaton
1970
john
british
cellular
horton
over-popul
life
reproduct
mathematician
1-d
stonesj
querynam
poorquerypercentag
databas
0316227
3627
one-dimension
326
tap
993
prevent
lockingtreeint
lockingtre
unlockint
upgrad
lockint
upgradeint
arri-k
arr5
arr4
k-increas
arr3
041
4567014
0144567
workerj
difficultyi
posx
angle2
vision
tag
posi
sampl
countk
statist
093
symmetr
distancethreshold
334
438
hasapplei
443
hasappl
271
017
ordersicustomernameitablenumberifooditemi
header
tablenumberi
418
fooditemi
customernamei
818
238
0122n
p2n
pi1
522
abcabc
4x
directioni
max5
899
maxbi
maxai
tripletsj
maxci
tripletsi
max2
max3
movecost
fatigu
startat
0954
pushcost
162
microwav
targetsecond
ratingj
ratingk
